Repository: niharika123456789/video-sdk
Catalog: languages/wp-kirk-*.po
Languages: es_es, it_it

source: WP Bones Demo WordPress plugin
es_es: Plugin de WordPress WP Bones Demo
it_it: Benvenuto nel plugin WordPress usato come modello WP Bones

source: Hello, Captain!
es_es: ¡Hola, capitán!
it_it: Salve, Capitano!

source: Main View
es_es: Vista principal
it_it: Vista principale

source: Assets
es_es: Activos
it_it: Asset

source: React Application
es_es: Aplicación React
it_it: Applicazione React

source: React Settings
es_es: Configuración de React
it_it: Impostazioni React

source: Ajax Example
es_es: Ejemplo de Ajax
it_it: Esempio Ajax

source: Options
es_es: Opciones
it_it: Opzioni

source: Options View
es_es: Vista de opciones
it_it: Visualizzazione opzioni

source: Options Resource
es_es: Recurso de opciones
it_it: Risorsa Opzioni

source: Official Packages
es_es: Paquetes Oficiales
it_it: Pacchetti ufficiali

source: Tables Example #1
es_es: Ejemplo de Tablas #1
it_it: Esempio Tabelle #1

source: Tables Example #2
es_es: Ejemplo de tablas #2
it_it: Esempio Tabelle #2

source: Tables Example #3
es_es: Ejemplo de Tablas #3
it_it: Esempio Tabelle #3

source: Model
es_es: Modelo
it_it: Modello

source: Hello
es_es: Hola
it_it: Ciao

source: Title of page
es_es: Título de la página
it_it: Titolo della pagina

source: Second
es_es: Segundo
it_it: Seconda

source: Hello, Custom Page!
es_es: ¡Hola, página personalizada!
it_it: Salve, Pagina personalizzata!

source: You have clicked Ajax Trusted
es_es: Ha hecho clic en Ajax Trusted
it_it: Hai cliccato su Ajax Trusted

source: You have clicked Ajax Logged
es_es: Ha hecho clic en Ajax Registrado
it_it: Hai cliccato Ajax Logged

source: You have clicked Ajax notLogged
es_es: Ha hecho clic en Ajax notLogged
it_it: Hai cliccato Ajax nonLogged

source: My amazing list of Cakes
es_es: Mi increíble lista de pasteles
it_it: La mia incredibile lista di Torte

source: Description
es_es: Descripción
it_it: Descrizione

source: Ingredients
es_es: Ingredientes
it_it: Ingredienti

source: HTTP Methods
it_it: Metodi HTTP

source: From release v0.13+ WPBones provides a simple way to handle the WordPress Rest API.
it_it: Dalla versione v0.13+ WPBones fornisce un modo semplice per gestire l'API Rest di WordPress.

source: To create your custom API, you have to create a new folder into
it_it: Per creare l'API personalizzata, è necessario creare una nuova cartella in

source: in the root of your plugin. The main folder will be the vendor. Usually, into the vendor folder you'll create the version folder as well. For example, you may create
it_it: nella radice del tuo plugin. La cartella principale sarà il fornitore. Di solito, nella cartella del fornitore crei anche la cartella della versione. Ad esempio, è possibile creare

source: Now, we can start to create the Rest API route by adding a new file in the our structure. For example, we'll use
it_it: Ora, possiamo iniziare a creare il percorso dell'API Rest aggiungendo un nuovo file nella nostra struttura. Ad esempio, utilizzeremo

source: Let's see a simple implementation of
it_it: Vediamo una semplice implementazione di

source: You can try the API
it_it: Puoi provare l'API

source: here
it_it: clicca qui

source: The Route class supports the following HTTP methods:
it_it: La classe Route supporta i seguenti metodi HTTP:

source: In short, the same supported by the WordPress REST API and defined in the
it_it: Insomma, lo stesso supportato dalle API REST di WordPress e definito nel

source: using the
it_it: utilizzando il

source: method
it_it: metodo

source: Instead of use the static method
it_it: Invece di utilizzare il metodo statico

source: and so on, you can use the
it_it: e così via, è possibile utilizzare il

source: instead. You will be able to use multiple HTTP verbs at the same time.
it_it: invece. Sarai in grado di utilizzare più verbi HTTP contemporaneamente.

source: You will find further information and details in the
it_it: Troverete ulteriori informazioni e dettagli nella sezione

source: Official WP Bones docs
it_it: Documentazione ufficiale di WP Bones

source: Styles
it_it: Stili

source: ReactJS and Typescript
it_it: ReactJS e Dattiloscritto

source: WP Bones provides a simple way to include assets in your plugin. You can include styles and scripts in the admin area and in the public area.
it_it: WP Bones fornisce un modo semplice per includere risorse nel tuo plugin. È possibile includere stili e script nell'area di amministrazione e nell'area pubblica.

source: Currently, WP Bones supports the following styles: standard CSS files, SCSS files, and LESS files. You may create your styles in the <code class="language-bash inline">resources/assets/css</code> directory.
it_it: Attualmente, WP Bones supporta i seguenti stili: file CSS standard, file SCSS e file LESS. Puoi creare i tuoi stili nella <code class="language-bash inline">resources/assets/css</code> directory.

source: The files <code class="language-bash inline">.css</code>, <code class="language-bash inline">.scss</code>, and <code class="language-bash inline">.less</code> will be compiled and you will find the css compiled in the <code class="language-html inline">public/css</code> directory.
it_it: I file <code class="language-bash inline">.css</code>, <code class="language-bash inline">.scss</code>, e <code class="language-bash inline">.less</code> verranno compilati e troverete il css compilato nella <code class="language-html inline">public/css</code> directory.

source: Next, you can include your styles by using the usual way
it_it: Successivamente, puoi includere i tuoi stili utilizzando il solito modo

source: Javascript files work in the same way as styles. You can create your javascript files in the <code class="language-bash inline">resources/assets/js</code> directory.
it_it: I file Javascript funzionano allo stesso modo degli stili. Puoi creare i tuoi file javascript nella <code class="language-bash inline">resources/assets/js</code> directory.

source: You can find more details in the <a href="https://wpbones.com/docs/GettingStarted/assets">Assets documentation</a>.
it_it: Per ulteriori informazioni, consulta la <a href="https://wpbones.com/docs/GettingStarted/assets">documentazione relativa alle risorse</a>.

source: You may use gulp to compile simple React components. you will be able to compile .jsx files and .tsx files. The compiled files will be in the <code class="language-html inline">public/js</code> directory.
it_it: Puoi usare gulp per compilare semplici componenti React. Sarai in grado di compilare file .jsx e file .tsx. I file compilati si troveranno nella <code class="language-html inline">public/js</code> directory.

source: React component is a JavaScript file that contains a component. It can be a simple component or a complex one. You can use it to create a custom page or a custom widget. Now it's available to use in your WordPress environment.
it_it: Il componente React è un file JavaScript che contiene un componente. Può essere un componente semplice o complesso. Puoi usarlo per creare una pagina personalizzata o un widget personalizzato. Ora è disponibile per l'uso nel tuo ambiente WordPress.

source: Step 1 - create a placeholder
it_it: Passaggio 1: creare un segnaposto

source: We create a placeholder <code class="language-html inline">div</code> with an <code class="language-html inline">id</code>.
it_it: Creiamo un segnaposto <code class="language-html inline">div</code> con un <code class="language-html inline">id</code>.

source: Step 2 - include the JavaScript file
it_it: Passaggio 2: includere il file JavaScript

source: In the Dashboard controller we include the JavaScript file. It's a simple example, but you can include it in a more complex way.
it_it: Nel controller Dashboard includiamo il file JavaScript. È un esempio semplice, ma puoi includerlo in un modo più complesso.

source: Step 3 - create the React component
it_it: Passaggio 3: creare il componente React

source: In the
it_it: Nel

source: directory we create a new file
it_it: directory, creiamo un nuovo file

source: with the following content:
it_it: con i seguenti contenuti:

source: Step 4 - compile
it_it: Passaggio 4: compilazione

source: Run the following command to compile the JavaScript file:
it_it: Esegui il seguente comando per compilare il file JavaScript:

source: Step 5 - check the result below
it_it: Passaggio 5: controlla il risultato qui sotto

source: Hello, I'm a Custom Page defined in
it_it: Salve, sono una pagina personalizzata definita in

source: folder
it_it: cartella

source: You may create a PHP file in
it_it: È possibile creare un file PHP in

source: folder and name it
it_it: e assegnargli un nome

source: Back
it_it: Indietro

source: Query Builder
it_it: Generatore di query

source: Example
it_it: Esempio

source: WP Bones's database query builder provides a convenient, fluent interface to creating and running database queries. It can be used to perform most database operations in your WordPress instance.
it_it: Il generatore di query per database di WP Bones fornisce un'interfaccia comoda e fluida per la creazione e l'esecuzione di query su database. Può essere utilizzato per eseguire la maggior parte delle operazioni di database nell'istanza di WordPress.

source: You can find more
it_it: Puoi localizzarmi

source: example here
it_it: esempio qui

source: You may include the Eloquent ORM to provide a beautiful, simple ActiveRecord implementation for working with your database. Each database table has a corresponding "Model" which is used to interact with that table. Models allow you to query for data in your tables, as well as insert new records into the table.
it_it: È possibile includere l'Eloquent ORM per fornire un'implementazione ActiveRecord semplice e bella per lavorare con il database. Ogni tabella di database ha un "Modello" corrispondente che viene utilizzato per interagire con quella tabella. I modelli consentono di eseguire query sui dati nelle tabelle e di inserire nuovi record nella tabella.

source: You may install Eloquent ORM in your plugin by using
it_it: È possibile ottenere le informazioni sul plug-in utilizzando

source: As we are using the complete illuminate database package, for further documentation on using the various database facilities this library provides, consult the
it_it: Poiché stiamo utilizzando il pacchetto completo del database illuminate, per ulteriore documentazione sull'utilizzo delle varie strutture di database fornite da questa biblioteca, consultare il

source: Laravel framework documentation
it_it: Documentazione del framework Laravel

source: Query WordPress users table
it_it: Interroga la tabella degli utenti di WordPress

source: Output
it_it: Uscita

source: Find
it_it: Trova

source: Of course, you'll be able to use all eloquent features
it_it: Naturalmente, sarai in grado di utilizzare tutte le caratteristiche eloquenti

source: Custom Table
it_it: Pagina personalizzata

source: Alongside the WordPress table you may use eloquent for your custom database table
it_it: Oltre alla tabella di WordPress, puoi utilizzare eloquent per la tua tabella di database personalizzata

source: and get single column value
it_it: e ottieni il valore di una singola colonna

source: Loop into
it_it: Ciclo in

source: For further documentation on using the various database facilities this library provides, consult the
it_it: Per ulteriore documentazione sull'utilizzo delle varie strutture di database fornite da questa biblioteca, consultare il

source: Hello, I'm the first %s view
es_es: Hola, soy el primero %s ver
it_it: Ciao, sono la prima vista del plugin %s

source: Passing data to view
es_es: Pasar datos a la vista
it_it: Passaggio di dati alla visualizzazione

source: Configuration
es_es: Configuración
it_it: Configurazione

source: Plugin information
es_es: Información del plugin
it_it: Informazioni sul plugin

source: Custom Pages
es_es: Páginas personalizadas
it_it: Pagine Personalizzate

source: Welcome to the WP Bones template WordPress plugin
es_es: Bienvenido al plugin de WordPress de plantillas WP Bones
it_it: Benvenuto nel plugin WordPress usato come modello WP Bones

source: This is a simple template plugin for WordPress. It is based on the WP Bones framework.
es_es: Este es un complemento de plantilla simple para WordPress. Se basa en el marco WP Bones.
it_it: Questo è un semplice plugin per modelli per WordPress. Si basa sul framework WP Bones.

source: It is a plugin that shows most of the features of the WP Bones framework. It is a good starting point for creating your own plugin.
es_es: Es un complemento que muestra la mayoría de las características del marco WP Bones. Es un buen punto de partida para crear tu propio plugin.
it_it: Si tratta di un plugin che mostra la maggior parte delle funzionalità del framework WP Bones. È un buon punto di partenza per creare il tuo plugin.

source: This view is displayed by a Controller connected to the menu you have selected.
es_es: Esta vista se muestra mediante un controlador conectado al menú que ha seleccionado.
it_it: Questa vista viene visualizzata da un controller collegato al menu selezionato.

source: The menu is defined in the
es_es: El menú se define en el archivo
it_it: Il menu è definito nel

source: The controller is located in the
es_es: El controlador se encuentra en el
it_it: Il controller si trova nel

source: The HTML part view is located in the
es_es: La vista de parte HTML se encuentra en el archivo
it_it: La vista HTML si trova nella

source: You may get variable from the controller. For example, the variable
es_es: Puede obtener una variable del controlador. Por ejemplo, la variable
it_it: È possibile ottenere una variabile dal controller. Ad esempio, la variabile

source: is
es_es: es
it_it: é

source: Get the
es_es: Obtener el
it_it: Ottieni il

source: configuration by using
es_es: configuración mediante el uso de
it_it: configurazione usando

source: It will return
es_es: Volverá
it_it: Restituirà

source: You may get the plugin information by using
es_es: Puede obtener la información del complemento mediante el uso de
it_it: È possibile ottenere le informazioni sul plug-in utilizzando

source: To create a custom pages without a menu, you may config the
es_es: Para crear páginas personalizadas sin un menú, puede configurar el archivo
it_it: Per creare una pagina personalizzata senza un menu, è possibile configurare il

source: file in the
es_es: en el archivo
it_it: nel file

source: folder of the Plugin
es_es: carpeta del Plugin
it_it: cartella del Plugin

source: For example, you may create a
es_es: Por ejemplo, puede crear un archivo
it_it: Ad esempio, è possibile creare un

source: folder of the plugin
es_es: carpeta del plugin
it_it: cartella del plugin

source: Here is an example of
es_es: A continuación, se muestra un ejemplo de
it_it: Ecco un esempio di

source: You can get the custom page URL by using
es_es: Puede obtener la dirección URL de la página personalizada mediante
it_it: È possibile ottenere l'URL della pagina personalizzata utilizzando

source: Custom Page
es_es: Personalice Página
it_it: Pagina personalizzata

source: Assets Menu
it_it: Menu Asset

source: Switch Button Post Test
it_it: Pulsante di Commutazione Test Post

source: Getting Post
it_it: Ottieni Post

source: Flags for WP Bones is a PHP package designed for the WP Bones framework, allowing you to enable or disable features in plugins using YAML configuration files. This approach simplifies feature management and makes the plugin more flexible and easy to configure, even for non-technical users.
it_it: Flags for WP Bones è un pacchetto PHP progettato per il framework WP Bones, che permette di abilitare o disabilitare funzionalità nei plugin utilizzando file di configurazione YAML. Questo approccio semplifica la gestione delle funzionalità e rende il plugin più flessibile e facile da configurare, anche per gli utenti non tecnici.

source: Why use flags instead the PHP code?
it_it: Perché usare i flag invece del codice PHP?

source: The flags file is specifically designed to be used by non-developers.
it_it: Il file flag è specificamente progettato per essere utilizzato da non sviluppatori.

source: It's easier to understand and modify.
it_it: È più facile da capire e modificare.

source: For this reason, it's recommended to use YAML flags instead of PHP code.
it_it: Per questo motivo, si raccomanda di utilizzare i flag YAML invece del codice PHP.

source: You can provide this file to your clients or users, and they can easily change the behavior of the plugin.
it_it: Puoi fornire questo file ai tuoi clienti o utenti, e loro possono facilmente modificare il comportamento del plugin.

source: Remember that the flags file is optional. You can use it or not.
it_it: Ricorda che il file delle flag è opzionale. Puoi usarlo o meno.

source: You may get the flag by using
it_it: Puoi ottenere il flag utilizzando

source: You may use the dot notation to get the flag.
it_it: Puoi usare la notazione a punto per ottenere il flag.

source: For example
it_it: Ad esempio

source: More information
it_it: Maggiori Informazioni

source: Hello, I'm a second view
it_it: Ciao, sono la secondo vista personalizzata

source: You can localize me
es_es: Puedes localizarme
it_it: Puoi localizzarmi

source: Click me for Ajax logged
it_it: Clicca qui per gli utenti loggati

source: Click me for Ajax trusted
it_it: Clicca qui per gli tutti gli utenti

source: Click me for Ajax notLogged
it_it: Clicca qui per gli utenti non loggati

source: The %s is a collection of React components that are designed to be simple, easy to use, and accessible. The library is built with TypeScript and has a small bundle size, making it a great choice for building modern web applications.
it_it: La %s è una collezione di componenti React che sono progettati per essere semplici, facili da usare e accessibili. La libreria è costruita con TypeScript e ha una dimensione del pacchetto ridotta, rendendola una scelta eccellente per lo sviluppo di applicazioni web moderne.

source: Some of the key features of Mantine include:
it_it: Alcune delle caratteristiche principali di Mantine includono:

source: Simple and easy-to-use components
it_it: Componenti semplici e facili da usare

source: Accessible design and keyboard navigation
it_it: Design accessibile e navigazione da tastiera

source: Dark mode support
it_it: Supporto della modalità oscura

source: Customizable styles and themes
it_it: Stili e temi personalizzabili

source: Support for TypeScript
it_it: Supporto per TypeScript

source: Small bundle size
it_it: Fascio di piccole dimensioni

source: Active development and community support
it_it: Sviluppo attivo e sostegno alla comunità

source: And much more!
it_it: E molto altro!

source: In this Demo we are using the %s to create a simple tabbed interface. And we are using the %s to handle the routing.
it_it: In questa demo stiamo usando il %s per creare un’interfaccia a schede semplice. E stiamo usando il %s per gestire il routing.

source: This is a React component that is rendered inside a div with the id react-app.
it_it: Questo è un componente React che viene renderizzato all'interno di un div con l'id react-app.

source: The component was created using the official WordPress package for React
it_it: Il componente è stato creato utilizzando il pacchetto WordPress ufficiale per React

source: Obviously, this is a very simple example, but it should give you a good starting point for creating more complex interfaces. And remember, you can use any React library you want, not just Mantine.
it_it: Ovviamente, questo è un esempio molto semplice, ma dovrebbe darti un buon punto di partenza per creare interfacce più complesse. E ricorda, puoi usare qualsiasi libreria React che desideri, non solo Mantine.

source: Swimming challenge
it_it: Sfida di nuoto

source: 32 km / week
it_it: 32 km / settimana

source: Progress
it_it: Progresso

source: 4 days left
it_it: 4 giorni rimasti

source: Overview
it_it: Panoramica

source: Settings
it_it: Impostazioni

source: Say Hello, Mantine Application
it_it: Di Ciao, Applicazione Mantine

source: Database
es_es: Base de datos

source: Eloquent ORM
es_es: ORM elocuente

source: Search Cakes
es_es: Buscar Pasteles

source: Delete
es_es: Borrar

source: Keep Trash
es_es: Guarda la basura

source: Choccolate
es_es: Chocolate

source: file.
es_es: archivo.
